// This is an open source non-commercial project. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com

/** @file StixIdpu.h
Hardware addresses definitions
This file contains special function register and region definitions (memory map)
for StixIdpu.
*/

#ifndef __STIXIDPU_H__
#define __STIXIDPU_H__

/* Special Constants */
#define TECHNOLOGY                                             0
#define SYSTEM_BUILD                                           1013
#define SYSTEM_RELEASE                                         34
#define USEEEPROMTYPEBIT                                       0
#define SPW0NODEADDR                                           1
#define SPW1NODEADDR                                           2
#define SPWDESTKEY                                             0
#define SYSTEM_CLOCK                                           20000000
#define NAHBMASTERS                                            5
#define NAHBSLAVES                                             7
#define NAPBSLAVES                                             10
#define PROT_CHANNEL_NUMBER                                    9
#define ROTB_MAX_BLOCKS                                        104448
#define UNLOCKING_TOKEN                                        165
#define RESET_TOKEN                                            165
#define WDOG_RELOAD                                            100000000

#define STIXSPW_TIME_TCTRL                                     6
#define STIXSPW_TIME_TCTRL_MASK                                0x3

#define STIXSPW_TIME_TIMECNT                                   0
#define STIXSPW_TIME_TIMECNT_MASK                              0x3F

#define STIXSPW_TIMERDISC_DISCONNECT                           12
#define STIXSPW_TIMERDISC_DISCONNECT_MASK                      0x3FF

#define STIXSPW_TIMERDISC_RESERVED                             22
#define STIXSPW_TIMERDISC_RESERVED_MASK                        0x3FF

#define STIXSPW_TIMERDISC_TIMER64                              0
#define STIXSPW_TIMERDISC_TIMER64_MASK                         0xFFF


/* Register Structures entry points */
#define EEPROM_REGISTERS                                       ((ftEepromCtrlRegs_s *) EEPROM_APB_BASE)
#define FLASH_REGISTERS                                        ((ftNandCtrlRegs_s *) FLASH_APB_BASE)
#define IRQCTRL_REGISTERS                                      ((irqmpRegs_s *) IRQCTRL_APB_BASE)
#define SDRAM_REGISTERS                                        ((ftSdCtrl16Regs_s *) SDRAM_APB_BASE)
#define SPW_REGISTERS                                          ((stixSpwRegs_s *) SPW_APB_BASE)
#define STIXCTRL_REGISTERS                                     ((stixCtrlRegs_s *) STIXCTRL_APB_BASE)
#define TIMER_REGISTERS                                        ((gptimerRegs_s *) TIMER_APB_BASE)
#define UART_REGISTERS                                         ((apbuartRegs_s *) UART_APB_BASE)

/* Interrupt definitions */
#define IRQ_FLASH                                               1 /* Interrupt indicating that last operation was finished. */
#define IRQ_SPW                                                 13 /* Default Interrupt for GRSPW controller. */
#define IRQ_STIXCTRL_DETCTRL                                    3 /* Detector Controller interrupt. (Internal FIFO overflow, SEU in Detectors, Calibration report ready, Quick Look buffers switch)  */
#define IRQ_STIXCTRL_EDAC                                       6 /* Errors (DED) in Detector's Cache Memory or in Rotating Buffer's SDRAM memory. Cache EDAC Interrrupt is reported if OpMode of Cache memory is set to 0. */
#define IRQ_STIXCTRL_HK                                         4 /* Housekeeping Monitored Value exceeded threshold. */
#define IRQ_STIXCTRL_OTHERISON                                  5 /* Interrupt triggered when Other IDPU becomes On. */
#define IRQ_STIXCTRL_ROTB                                       7 /* Rotating Buffer overflow interrupt. This memory is reportet whenever HW writes new block and Rotating Buffer memory is full. */
#define IRQ_TIMER_TIMER0                                        10 /* Timer0 overflow interrupt. */
#define IRQ_TIMER_TIMER1                                        11 /* Timer1 overflow interrupt. */
#define IRQ_UART                                                2 /* Interrupt indicating reception/ transmission of character or FIFO empty/full status. */

/* Register Blocks definitions */
typedef struct
{
    __volatile__ uint32_t counter; /* 0x00-0x03 Counter value register*/
    __volatile__ uint32_t reload; /* 0x04-0x07 Reload value register*/
    __volatile__ uint32_t control; /* 0x08-0x0B Control register*/
    __volatile__ uint32_t notUsed0; /* 0x0C-0x0F */
} timer_s;


/* Register Structures definitions */
typedef struct
{
    __volatile__ uint32_t data; /* 0x00-0x03 UART Data register*/
    __volatile__ uint32_t status; /* 0x04-0x07 UART Status register*/
    __volatile__ uint32_t control; /* 0x08-0x0B UART Control register*/
    __volatile__ uint32_t scaler; /* 0x0C-0x0F UART Scaler register*/
    __volatile__ uint32_t fifo; /* 0x10-0x13 UART FIFO debug register*/
} apbuartRegs_s;

typedef struct
{
    __volatile__ uint32_t status; /* 0x00-0x03 EepromCtrl Commands and Status  Register*/
} ftEepromCtrlRegs_s;

typedef struct
{
    __volatile__ uint32_t cmdSta; /* 0x00-0x03 Command/Status register.*/
    __volatile__ uint32_t pageAddress; /* 0x04-0x07 Page Address in NAND FLASH for operation.*/
    __volatile__ uint32_t ramAddress; /* 0x08-0x0B AHB Address for operation.*/
} ftNandCtrlRegs_s;

typedef struct
{
    __volatile__ uint32_t configStatus; /* 0x00-0x03 Control/Status Register of FtSdCtrl16*/
    __volatile__ uint32_t edac; /* 0x04-0x07 EDAC Configuration/Status Register*/
} ftSdCtrl16Regs_s;

typedef struct
{
    __volatile__ uint32_t scalerValue; /* 0x00-0x03 Scaler configuration register*/
    __volatile__ uint32_t scalerReload; /* 0x04-0x07 Scaler Reload register*/
    __volatile__ uint32_t config; /* 0x08-0x0B Configuration register*/
    __volatile__ uint32_t notUsed0; /* 0x0C-0x0F */
    timer_s timer[2]; /* 0x10-0x30 */
} gptimerRegs_s;

typedef struct
{
    __volatile__ uint32_t level; /* 0x00-0x03 Interrupt level register*/
    __volatile__ uint32_t pending; /* 0x04-0x07 Interrupt pending register*/
    __volatile__ uint32_t force; /* 0x08-0x0B Interrupt force register (NCPU = 1)*/
    __volatile__ uint32_t clear; /* 0x0C-0x0F Interrupt clear register*/
    __volatile__ uint32_t notUsed0[12]; /* 0x10-0x3F */
    __volatile__ uint32_t mask; /* 0x40-0x43 Processor interrupt mask register*/
    __volatile__ uint32_t notUsed1[31]; /* 0x44-0xBF */
    __volatile__ uint32_t extIntAck; /* 0xC0-0xC3 Processor extended interrupt acknowledge register*/
} irqmpRegs_s;

typedef struct
{
    __volatile__ uint32_t ideFxCmdSta; /* 0x00-0x03 Detector Controller Command/Status Register*/
    __volatile__ uint32_t idefxModeData; /* 0x04-0x07 Idefx Read Mode Switch On/Off bits (16 MSB bits) and Response Data (16 LSB bits) of last command. */
    __volatile__ uint32_t idefxWriteMask; /* 0x08-0x0B Idefx Group Mask for configuration.*/
    __volatile__ uint32_t idefxConfig; /* 0x0C-0x0F IdeFX configuration register*/
    __volatile__ uint32_t testPulseCmdSta; /* 0x10-0x13 Test Pulse Generation register.*/
    __volatile__ uint32_t fsmCmd; /* 0x14-0x17 Readout FSM Control Register.*/
    __volatile__ uint32_t fsmSta; /* 0x18-0x1B Readout FSM Control/Status Register.*/
    __volatile__ uint32_t fsmIntTime; /* 0x1C-0x1F Integration Time for FSM*/
    __volatile__ uint32_t fsmQlConfig; /* 0x20-0x23 Integration Time for FSM for QL accumulators.*/
    __volatile__ uint32_t fsmQlVarDMask; /* 0x24-0x27 Detector Mask for QLVAR (VARDMASK).*/
    __volatile__ uint32_t fsmQlVarEMask; /* 0x28-0x2B Energy Mask for QLVAR (VAREMASK).*/
    __volatile__ uint32_t fsmIntEvents; /* 0x2C-0x2F Maximum events to integrate for FSM*/
    __volatile__ uint32_t fsmEvents; /* 0x30-0x33 FSM event counter*/
    __volatile__ uint32_t fsmSumDmask; /* 0x34-0x37 Detector Mask for EACC and SUMCNT (SUMDMASK).*/
    __volatile__ uint32_t fsmSumEmask; /* 0x38-0x3B Energy Level Mask for SUMCNT (SUMEMASK).*/
    __volatile__ uint32_t fsmResult1; /* 0x3C-0x3F Readout FSM result register 1*/
    __volatile__ uint32_t fsmResult2; /* 0x40-0x43 Readout FSM result register 2*/
    __volatile__ uint32_t fsmCalMask; /* 0x44-0x47 Readout FSM Calibration Detector Mask*/
    __volatile__ uint32_t fsmCalCount; /* 0x48-0x4B Calibration Counter*/
    __volatile__ uint32_t fsmCalRes; /* 0x4C-0x4F Calibration Event Data*/
    __volatile__ uint32_t cacheCmdSta; /* 0x50-0x53 Cache Controller Command/Status register.*/
    __volatile__ uint32_t rotbCmdSta; /* 0x54-0x57 Circular buffer (FIFO) controller Control/Status register.*/
    __volatile__ uint32_t rotbConfig; /* 0x58-0x5B Circular buffer (FIFO) controller Configuration register.*/
    __volatile__ uint32_t attnCmdSta; /* 0x5C-0x5F Attenuator Controller Command Status Register*/
    __volatile__ uint32_t attnConfig1; /* 0x60-0x63 Attenuator Controller PWM Configuration Register 1*/
    __volatile__ uint32_t notUsed0; /* 0x64-0x67 */
    __volatile__ uint32_t asCmdSta; /* 0x68-0x6B Aspect System Control/Status Register.*/
    __volatile__ uint32_t asQlData[4]; /* 0x6C-0x7B Aspect System Quick look register.*/
    __volatile__ uint32_t notUsed1[3]; /* 0x7C-0x87 */
    __volatile__ uint32_t hkCmdSta; /* 0x88-0x8B Housekeeping Control/Status Register*/
    __volatile__ uint32_t hkAdc; /* 0x8C-0x8F Housekeeping On Demand*/
    __volatile__ uint32_t hkIrqSta; /* 0x90-0x93 Hardware protection status and irq mask*/
    __volatile__ uint32_t hkProtConfig[9]; /* 0x94-0xB7 HouseKeeping Automatic protection thresholds {n}.*/
    __volatile__ uint32_t notUsed2[4]; /* 0xB8-0xC7 */
    __volatile__ uint32_t longTimerSec; /* 0xC8-0xCB Long Timer Seconds.*/
    __volatile__ uint32_t longTimerSubSec; /* 0xCC-0xCF Long Timer SubSecond and Control/Status register.*/
    __volatile__ uint32_t unlockingReg; /* 0xD0-0xD3 Protection unlocking register.*/
    __volatile__ uint32_t watchDog; /* 0xD4-0xD7 WatchDog Control/Status Register.*/
    __volatile__ uint32_t magicReg; /* 0xD8-0xDB Start-up magic register.*/
    __volatile__ uint32_t notUsed3[5]; /* 0xDC-0xEF */
    __volatile__ uint32_t stixStatus; /* 0xF0-0xF3 General STIX Controller status register.*/
} stixCtrlRegs_s;

typedef struct
{
    __volatile__ uint32_t control; /* 0x00-0x03 Control register.*/
    __volatile__ uint32_t status; /* 0x04-0x07 GRSPW status register.*/
    __volatile__ uint32_t nodeAddress; /* 0x08-0x0B GRSPW node address register.*/
    __volatile__ uint32_t clockDivisor; /* 0x0C-0x0F GRSPW clock divisor register.*/
    __volatile__ uint32_t destKey; /* 0x10-0x13 GRSPW destination key.*/
    __volatile__ uint32_t time; /* 0x14-0x17 GRSPW time register.*/
    __volatile__ uint32_t timerDisc; /* 0x18-0x1B GRSPW timer and disconnect register.*/
    __volatile__ uint32_t notUsed0; /* 0x1C-0x1F */
    __volatile__ uint32_t dmaControl; /* 0x20-0x23 GRSPW DMA control register*/
    __volatile__ uint32_t dmaMaxRxLength; /* 0x24-0x27 DMA channel 1 rx maximum length*/
    __volatile__ uint32_t dmaTxDescAddr; /* 0x28-0x2B DMA channel 1 transmit descriptor table address.*/
    __volatile__ uint32_t dmaRxDescAddr; /* 0x2C-0x2F DMA channel 1 receive descriptor table address.*/
} stixSpwRegs_s;


/* Interrupt structure */
typedef enum 
{
    E_FLASH_IRQ = IRQ_FLASH /* Interrupt indicating that last operation was finished. */,
    E_UART_IRQ = IRQ_UART /* Interrupt indicating reception/ transmission of character or FIFO empty/full status. */,
    E_STIXCTRL_DETCTRL_IRQ = IRQ_STIXCTRL_DETCTRL /* Detector Controller interrupt. (Internal FIFO overflow, SEU in Detectors, Calibration report ready, Quick Look buffers switch)  */,
    E_STIXCTRL_HK_IRQ = IRQ_STIXCTRL_HK /* Housekeeping Monitored Value exceeded threshold. */,
    E_STIXCTRL_OTHERISON_IRQ = IRQ_STIXCTRL_OTHERISON /* Interrupt triggered when Other IDPU becomes On. */,
    E_STIXCTRL_EDAC_IRQ = IRQ_STIXCTRL_EDAC /* Errors (DED) in Detector's Cache Memory or in Rotating Buffer's SDRAM memory. Cache EDAC Interrrupt is reported if OpMode of Cache memory is set to 0. */,
